[
  {
    "id": "1",
    "title": "Frontend",
    "banner": "/image",
    "description": "This section features a collection of my latest creations, including landing pages and static website templates. I've poured my creativity and expertise into crafting visually stunning and user-friendly designs that are sure to captivate and engage visitors. take a look around and see how my designs can elevate your online presence and leave a lasting impression on your audience.",
    "projects": []
  },
  {
    "id": "2",
    "title": "Full stack",
    "banner": "/image",
    "description": "Welcome to the Full Stack MERN projects section of my portfolio. Here, you'll find a collection of web applications that I've built from the ground up using the MERN stack.Whether you're interested in e-commerce, social media, or other web applications, I'm confident that you'll find something of interest in this section.",
    "projects": [
      {
        "id": 1,
        "type":"Service-provider",
        "name": "D-vacuum",
        "date":"Oct 2022",
        "logo":"https://i.ibb.co/qNXNYmR/d-vacuum.png",
        "image": "https://i.ibb.co/Y2pzt3b/screencapture-d-vacuum-a11-web-app-2023-03-25-23-51-25.png",
        "description": "D-vacuum is a B2C service project that aims to create a user-friendly website for a client's business. The website will enable the client to upload their services and allow customers to purchase/book any service they need. Additionally, every service will have a real-time review section where users can view others' reviews and add their own. Users can also modify their reviews as needed. Finally, the client can easily update their services as necessary to keep the website current and relevant.",
        "live": "https://d-vacuum-a11.web.app/",
        "gitHubClient": "https://github.com/mahfuzurrahman01/d-vacuum-client",
        "gitHubServer": "https://github.com/mahfuzurrahman01/d-vacuum-server"
      },
      {
        "id": 2,
        "type":"E-commerce",
        "name": "V-Furniture",
        "date":"Nov 2022",
        "logo":"https://i.ibb.co/x82gKpd/V-Furniture.png",
        "image": "https://i.ibb.co/9GcG1V3/screencapture-v-furniture-ef0e9-web-app-2023-03-26-00-16-50.png",
        "description": "Urban Furniture is an e-commerce website that offers a personalized dashboard system based on the user's role. When creating an account, users can select whether they want to be a buyer or a seller, and their dashboard will reflect their choice. Additionally, the admin has a separate dashboard where they can manage sellers and buyers and get updates on the business. Sellers can easily update their products, edit their details, and boost them for better visibility on the front page. Buyers can add items to their cart, create a wishlist, and securely make payments via card payment.",
        "live": "https://v-furniture-ef0e9.web.app/",
        "gitHubClient": "https://github.com/mahfuzurrahman01/urban-furniture-client",
        "gitHubServer": "https://github.com/mahfuzurrahman01/urban-furniture-server"
      }
    ]
  },
  {
    "id": "3",
    "title": "Real life",
    "banner": "/image",
    "description": "Welcome to my real life projects showcase! Here, I'm excited to share with you some of the recent projects I've had the opportunity to work on. Each project represents a unique challenge that required careful planning, collaboration, and execution. ",
    "projects": []
  }
]